import React, { useEffect } from "react";
import { Typography } from "@material-ui/core";

const Terms: React.FC = () => {

	return (
		<div>
			<p className='terms'>
				<Typography variant="body2" gutterBottom>
					<Typography variant="h6" gutterBottom>登録規約</Typography>
					本規約は、株式会社m-Lab（以下「m-Lab」といいます）が運営する「
					HARVEST」（以下「本サイト」といいます）にご登録いた
					だく全ての方（以下「登録者」といいます）に適用されるものとします。<br/>
					<br/>
					第１条（登録）<br/>
					登録者は、自らの意思によって本サイトに登録するものとします。<br/>
					<br/>
					第２条（変更の届出）<br/>
					登録者は、登録内容に変更があった場合には、m-Labに対し速やかにその届
					出をしなければなりません。この届出を遅滞したことにより損害が発生した場
					合、当社は何ら責任を負いません。<br/>
					<br/>
					第３条（禁止事項）<br/>
					登録者は、次の行為をすることはできません。<br/>
					１．虚偽の情報を登録し、又は提供すること<br/>
					２．本サイトの運営の妨げとなる一切の行為<br/>
					３．公序良俗に反する行為<br/>
					４．法令に反する一切の行為<br/>
					５．その他、m-Labが不適切と判断する一切の行為<br/>
					<br/>
					第４条（免責事項）<br/>
					１．m-Labは、登録者に新サービス等（以下「新サービス」といいます）に
					関する情報を連絡しますが、それ以外については何ら保証しません。<br/>
					２．m-Labは、新サービスアンケートサイトへの登録者が少ない等、諸事情
					により新サービスの提供が出来ない場合がありますが、新サービス提供を保証
					するものではありません。<br/>
					３．m-Labは、本サイトへの登録によって登録者に発生する一切の損害に対
					し、何らの責任も負担しません。<br/>
					<br/>
					第５条（規約の変更）<br/>
					m-Labは、登録者の承諾を得ることなく、本規約を随時変更することができ
					ます。<br/>
					<br/>
					第６条（管轄裁判所）<br/>
					本規約に関する紛争については、東京地方裁判所を第一審の管轄裁判所としま
					す。<br/>
					【個人情報の取扱いについて】<br/>
					株式会社m-Labは、本ウェブサイトにおいて取得した個人情報を以下のとお
					り取扱います。<br/>
					a）個人情報を取得する事業者<br/>
					株式会社m-Lab<br/>
					b）個人情報保護管理者の職名、所属及び連絡先<br/>
					株式会社m-Lab<br/>
					https://m-lab.inc/<br/>
					c）個人情報の利用目的<br/>
					取得した個人情報は、以下の各号に掲げる目的の範囲内でのみ利用します。
					（1）新サービス提供の連絡・広報のため<br/>
					d）第三者への提供取得した個人情報を第三者に提供することはありません。<br/>
					e）個人情報の取扱いの委託個人情報の取扱いの全部または一部を委託する場
					合があります。この際は、個人情報の取扱に関する契約を締結し、委託先に対
					する必要かつ適切な監督を行います。<br/>
					f）本人からの開示要求など本人から（1）利用目的の通知、（2）開示、（3）
					訂正、追加又は削除、（4）利用の停止、消去又は第三者への提供の停止など
					の必要がある場合、以下の問合せ窓口よりお問合せください。<br/>
					https://m-lab.inc/contact<br/>
					g）任意性<br/>
					個人情報の登録はすべて必須となっています。<br/>
					h）容易に認識できない個人情報の取得方法<br/>
					本サービスを利用いただく際にCookie情報を取得します。<br/>
					i）統計データ<br/>
					株式会社m-Labは、統計的に処理した情報を公表・販売することがあります。<br/>
					この場合、個々のユーザーを識別できる情報は含まれません。<br/>
				</Typography>
			</p>
		</div>
	);
};

export default Terms;
